Word for advice: Whenever we are dealing with big data: Millions and billions of data, don't just create dataframes and leave them as it is because with increasing number of such dataframes, your jupyter notebook will end up utilizing more and more RAM and the system will end up becoming slow.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.DataFrame([[1,3,2,4],[5,3,6,8],[11,5,4,33],[4,7,88,3]])
df1

    0  1   2   3
0   1  3   2   4
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3

In [3]:
df1.iloc[0,2]

2

In [4]:
df1.iloc[0:3,1:]

   1  2   3
0  3  2   4
1  3  6   8
2  5  4  33

In [5]:
df1=pd.DataFrame([[1,3,2,4],[5,3,6,8],[11,5,4,33],[4,7,88,3]],columns=['A','B','C','D'])
df1

    A  B   C   D
0   1  3   2   4
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3

In [10]:
print(df1.iloc[0:3,1:])

   B  C   D
0  3  2   4
1  3  6   8
2  5  4  33